[
  "calendar",
  "dataview",
  "periodic-notes",
  "obsidian-kanban",
  "obsidian-git",
  "obsidian-icon-folder",
  "obsidian-tts",
  "obsidian-spaced-repetition",
  "various-complements",
  "obsidian-statusbar-pomo"
]